Integračný manuál eFORM/Externá zbernica (USR)/TransformRelatedDocumentByType/EFORM_TRANSFORMRELATEDDOCUMENTBYTYPE_SOAP_V_1_0__REQ.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header>
		<Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://schemas.gov.sk/ServiceBus/service/1.0/IServiceBus/CallService</Action>
		<ActivityId CorrelationId="b285fd6a-7c64-4b29-88b6-0f17a62939b9" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">15d63c64-da0d-4ea0-b506-bf759414aa4a</ActivityId>
		<VsDebuggerCausalityData xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink"/>
	</s:Header>
	<s:Body>
		<CallService xmlns="http://schemas.gov.sk/ServiceBus/service/1.0">
			<serviceClass>EFORM_TRANSFORMRELATEDDOCUMENTBYTYPE_SOAP_V_1_0</serviceClass>
			<serviceParameter xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:d4p2="http://schemas.gov.sk/ServiceBusServiceProvider/Ness/eFormProvider/1.0" i:type="d4p2:TransformRelatedDocumentByTypeReq">
				<d4p2:FOTransform>true</d4p2:FOTransform>
				<d4p2:FormTemplate>
					<d4p2:Identifier>ED.DeliveryReportAuthorization</d4p2:Identifier>
					<d4p2:Version>
						<d4p2:Major>1</d4p2:Major>
						<d4p2:Minor>3</d4p2:Minor>
					</d4p2:Version>
				</d4p2:FormTemplate>
				<d4p2:RelatedDocumentXMLLanguage>sk</d4p2:RelatedDocumentXMLLanguage>
				<d4p2:RelatedDocumentXMLType>CLS_F_XML_EDOC</d4p2:RelatedDocumentXMLType>
				<d4p2:RelatedDocumentXSLTLanguage>sk</d4p2:RelatedDocumentXSLTLanguage>
				<d4p2:RelatedDocumentXSLTType>CLS_F_XSL_FO</d4p2:RelatedDocumentXSLTType>
			</serviceParameter>
		</CallService>
	</s:Body>
</s:Envelope>
